# 1. Напишите программу на Python для вычисления 
# суммы списка чисел.

# def summa(*arr):
#     return (sum(arr))
# print(summa(1,2,3,4,5,6,7,8,9,10))
#---------------------------------------------------------------------------------------

#2. Напишите программу на Python для получения факториала неотрицательного
#целого числа.

# def factorial(n):
#     if n == 1:
#         return n
#     return factorial(n-1) * n
# print(factorial(5))
#---------------------------------------------------------------------------------------

# 3. Напишите программу на Python для
# решения последовательности Фибоначчи с использованием рекурсии.

# def fibonachi(n):
#     if n <= 0 or n==1:
#         return 1
#     else:
#         return fibonachi(n-1) + fibonachi(n-2)
# n = 10
# fib = [fibonachi(i) for i in range(n+1)]
# print(fib)
#---------------------------------------------------------------------------------------

#CALCULATOR

# a = int(input(">>1 "))
# b = int(input(">>2 "))
# c = input('* / - + ')
# if c  == "*":
#     print(a * b)
# if c == "/":
#     print(a / b)
# if c == "+":
#     print(a + b)
# if c == "-":
#     print(a - b)



                                    

